# CornerMullionOverlapsOtherOnePlacedOnNeighboringRegion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..CornerMullionOverlapsOtherOnePlacedOnNeighboringRegion Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
Corner Mullion overlaps Mullion placed on neighboring Curtain region.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CornerMullionOverlapsOtherOnePlacedOnNeighboringRegion { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CornerMullionOverlapsOtherOnePlacedOnNeighboringRegion As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CornerMullionOverlapsOtherOnePlacedOnNeighboringRegion {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace